perf-testing/experiments/baseline-2x/results.log

Summary:
  Total:	1.2183 secs
  Slowest:	0.2760 secs
  Fastest:	0.0408 secs
  Average:	0.0580 secs
  Requests/sec:	820.8157
  
  Total data:	14000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.041 [1]	|
  0.064 [947]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.088 [2]	|
  0.111 [0]	|
  0.135 [0]	|
  0.158 [0]	|
  0.182 [0]	|
  0.205 [0]	|
  0.229 [0]	|
  0.253 [1]	|
  0.276 [49]	|■■


Latency distribution:
  10% in 0.0436 secs
  25% in 0.0443 secs
  50% in 0.0464 secs
  75% in 0.0487 secs
  90% in 0.0532 secs
  95% in 0.2493 secs
  99% in 0.2752 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0091 secs, 0.0408 secs, 0.2760 secs
  DNS-lookup:	0.0010 secs, 0.0000 secs, 0.0209 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0018 secs
  resp wait:	0.0487 secs, 0.0407 secs, 0.1033 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0022 secs

Status code distribution:
  [200]	1000 responses